ЛИС2/src/InformationRegisters/ЛабораторноеОборудованиеВЭксплуатации/ЛабораторноеОборудованиеВЭксплуатации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЛабораторноеОборудованиеВЭксплуатации</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ДатаВводаВЭксплуатацию</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>СрокДопустимойЭксплуатации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Лаборатория</name>
    <type>
      <types>CatalogRef.лис_Лаборатории</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Оборудование</name>
    <type>
      <types>CatalogRef.лис_ЛабораторноеОборудование</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РегистрационныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИнвентарныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаводскойНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаводскоеОбозначение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерПаспортаНаОборудование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаИзготовления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ЛИС2/src/Catalogs/лис_ЛабораторноеОборудование/лис_ЛабораторноеОборудование.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>лис_ЛабораторноеОборудование</name>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.лис_ТипыЛабораторногоОборудования</types>
    </type>
  </attributes>
  <attributes>
    <name>МетодикаВыполненияИзмерений</name>
    <type>
      <types>CatalogRef.МетодикиОпределенияИзмеренияАнализа</types>
    </type>
  </attributes>
  <attributes>
    <name>Изготовитель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерСИВГосреестре</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодичностьПоверки</name>
    <type>
      <types>CatalogRef.ПериодичностиПоверок</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.лис_Лаборатории</types>
    </type>
  </attributes>
  <attributes>
    <name>Погрешность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмеренияПогрешности</name>
    <type>
      <types>CatalogRef.ОКЕИ</types>
    </type>
  </attributes>
  <attributes>
    <name>КлассТочности</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Разряд</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПределИзмеренийОт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПределИзмеренийДо</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокЭксплуатации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТемператураОкружающейСредыОт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТемператураОкружающейСредыДо</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтносительнаяВлажность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальнаяПотребляемаяМощность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПитаниеНапряжение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПитаниеЧастота</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОпределяемыеХарактеристики</name>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.МетрологическиеХарактеристики</types>
      </type>
    </attributes>
    <attributes>
      <name>Погрешность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КлассТочности</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПределИзмеренийОт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПределИзмеренийДо</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ЛИС2/src/InformationRegisters/ЛабораторноеОборудованиеВЭксплуатации/ManagerModule.bsl
Функция ПечатьНаклеек(МассивОбъектов, ОбъектыПечати) Экспорт
	
	ТабДок = Новый ТабличныйДокумент;
	Макет = РегистрыСведений.ЛабораторноеОборудованиеВЭксплуатации.ПолучитьМакет("НаклейкиНаОборудование");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	лис_ЛабораторноеОборудование.ТемператураОкружающейСредыОт КАК От,
	|	лис_ЛабораторноеОборудование.ТемператураОкружающейСредыДо КАК До,
	|	лис_ЛабораторноеОборудование.ОтносительнаяВлажность,
	|	лис_ЛабораторноеОборудование.МаксимальнаяПотребляемаяМощность,
	|	лис_ЛабораторноеОборудование.ПитаниеНапряжение КАК Напряжение,
	|	лис_ЛабораторноеОборудование.ПитаниеЧастота КАК Частота,
	|	лис_ЛабораторноеОборудование.Наименование КАК НаименованиеОборудования
	|ИЗ
	|	Справочник.лис_ЛабораторноеОборудование КАК лис_ЛабораторноеОборудование
	|ГДЕ
	|	лис_ЛабораторноеОборудование.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", МассивОбъектов[0]);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ОбластьДанные = Макет.ПолучитьОбласть("УсловияЭксплуатации");
		ОбластьДанные.Параметры.Заполнить(Выборка);
		ОбластьДанные.Параметры.ТемператураОкружающейСреды = Выборка.От + "-" + Выборка.До;
	КонецЕсли;
	ТабДок.Вывести(ОбластьДанные);
	
	ОбластьДанные = Макет.ПолучитьОбласть("ДанныеОборудования");
	ОбластьДанные.Параметры.НаименованиеОборудования = МассивОбъектов[0];
	ОбластьДанные.Параметры.РегистрационныйНомер = МассивОбъектов[1];
	ОбластьДанные.Параметры.ЗаводскойНомер = МассивОбъектов[2];
	ОбластьДанные.Параметры.ИнвентарныйНомер = МассивОбъектов[3];
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	лис_ПоверкиЛабораторногоОборудованияСрезПоследних.Период КАК ДатаПериодическойАттестации,
	|	лис_ПоверкиЛабораторногоОборудованияСрезПоследних.ДатаСледующейПоверки КАК СрокПоследующейАттестации
	|ИЗ
	|	РегистрСведений.лис_ПоверкиЛабораторногоОборудования.СрезПоследних(
	|			&Дата,
	|			ЛабораторноеОборудование = &ЛабораторноеОборудование
	|				И ИнвентарныйНомер = &ИнвентарныйНомер
	|				И РегистрационныйНомер = &РегистрационныйНомер
	|				И ЗаводскойНомер = &ЗаводскойНомер) КАК лис_ПоверкиЛабораторногоОборудованияСрезПоследних";
	Запрос.УстановитьПараметр("ЛабораторноеОборудование", МассивОбъектов[0]);
	Запрос.УстановитьПараметр("РегистрационныйНомер", МассивОбъектов[1]);
	Запрос.УстановитьПараметр("ЗаводскойНомер", МассивОбъектов[2]);
	Запрос.УстановитьПараметр("ИнвентарныйНомер", МассивОбъектов[3]);
	Запрос.УстановитьПараметр("Дата", ТекущаяДата());
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ОбластьДанные.Параметры.Заполнить(Выборка);
	КонецЕсли;	
	
	ТабДок.Вывести(ОбластьДанные);
	
	Возврат ТабДок;

	
	
КонецФункции

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "НаклейкиНаОборудование", "Наклейки на оборудование",
			ПечатьНаклеек(МассивОбъектов, ОбъектыПечати),, "РегистрСведений.ЛабораторноеОборудованиеВЭксплуатации.НаклейкиНаОборудование");
	
КонецПроцедуры
